macOS14.0.sdk/usr/share/man/man8/fsck_apfs.8
.\" 
.\" Copyright (c) 2015-2018 Apple Inc. All rights reserved.
.\" 
.\" @APPLE_OSREFERENCE_LICENSE_HEADER_START@
.\" 
.\" This file contains Original Code and/or Modifications of Original Code
.\" as defined in and that are subject to the Apple Public Source License
.\" Version 2.0 (the 'License'). You may not use this file except in
.\" compliance with the License. The rights granted to you under the License
.\" may not be used to create, or enable the creation or redistribution of,
.\" unlawful or unlicensed copies of an Apple operating system, or to
.\" circumvent, violate, or enable the circumvention or violation of, any
.\" terms of an Apple operating system software license agreement.
.\" 
.\" Please obtain a copy of the License at
.\" http://www.opensource.apple.com/apsl/ and read it before using this file.
.\" 
.\" The Original Code and all software distributed under the License are
.\" distributed on an 'AS IS' basis, WITHOUT WARRANTY OF ANY KIND, EITHER
.\" EXPRESS OR IMPLIED, AND APPLE HEREBY DISCLAIMS ALL SUCH WARRANTIES,
.\" INCLUDING WITHOUT LIMITATION, ANY WARRANTIES OF MERCHANTABILITY,
.\" FITNESS FOR A PARTICULAR PURPOSE, QUIET ENJOYMENT OR NON-INFRINGEMENT.
.\" Please see the License for the specific language governing rights and
.\" limitations under the License.
.\" 
.\" @APPLE_OSREFERENCE_LICENSE_HEADER_END@
.\" 
.Dd March 6, 2018
.Dt FSCK_APFS 8
.Os "Mac OS X"
.Sh NAME
.Nm fsck_apfs
.Nd APFS consistency check
.Sh SYNOPSIS
.Nm fsck_apfs
.Op Fl n | y
.Op Fl q
.Op Fl l
.Op Fl s
.Op Fl S
.Op Fl o
.Ar device
.Sh DESCRIPTION
The
.Nm
utility verifies and repairs APFS containers and volumes.
.Pp
.Nm
checks the specified APFS containers and volumes and tries to repair
all detected inconsistencies.
.Pp
Because of inconsistencies between the block device and the buffer
cache, the raw device should always be used.
.Pp
In its current state, fsck_apfs checks the integrity of various container
data structures.
.Pp
The options are as follows:
.Bl -hang -offset indent
.It Fl q
Causes
.Nm
to quickly check whether the device is `clean'. If
.Ar device
is an APFS volume,
.Nm
will quickly check the APFS container and the specified APFS volume.
If
.Ar device
is an APFS container,
.Nm
will quickly check the APFS container and all the APFS volumes in it.
By default, no repairs are attempted during a quick check.
.It Fl n
Never attempt to repair any damage that is found.
.It Fl y
Always attempt to repair any damage that is found.
.It Fl l
Enable live verification mode.
This makes it possible to check an APFS
container which is currently mounted read-write, although no
repairs can be made. Note that live verification mode may cause your system to stop responding until
.Nm
completes.
.It Fl s
Print space verification summary.
.It Fl S
Skip iteration of snapshots (top-level snapshot structures will still be checked), although no
repairs can be made.
.It Fl o
Repair overallocations; please do not run an older fsck_apfs on newer systems with this option.
.El
.Sh EXIT STATUS
.Nm
exits with 0 on success, and >0 if error occurs.
.Sh SEE ALSO
.Xr fsck 8
.\".Sh BUGS
.\" .Nm
.\" is not able to fix some inconsistencies that it detects.
.\".Sh HISTORY
